elisp/dot-emacs.org
#+PROPERTY: header-args :tangle .emacs

* the only thing in .emacs.d is melpa packages and some state files
* Immediately set org-mode path
#+BEGIN_SRC emacs-lisp
;;;
;;; Org Mode
;;;
(add-to-list 'load-path (expand-file-name "~/extern/org-mode/lisp"))
(add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))
(require 'org)
#+END_SRC
* Package Management

#+BEGIN_SRC emacs-lisp

(setq
 package-enable-at-startup nil
 package-archives
 '(("melpa-stable" . "https://stable.melpa.org/packages/")
   ("melpa" . "https://melpa.org/packages/")
   ("org" . "http://orgmode.org/elpa/")
   ("gnu" . "https://elpa.gnu.org/packages/")))

(require 'package)
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t
      use-package-verbose t)

;(setq debug-on-quit t)
#+END_SRC

* ~src/home/elisp directory

#+BEGIN_SRC emacs-lisp
(defvar l-src-home (file-truename "~/src/home/"))
(defvar l-elisp-home (file-truename "~/src/home/elisp/"))
(add-to-list 'load-path (concat l-elisp-home "lib"))
#+END_SRC

#+results:
: l-elisp-home


* detect work vs home environment

#+BEGIN_SRC emacs-lisp

(defvar l-env-file (concat l-elisp-home "environment.el"))

(defun read-file (filePath)
  "Return filePath's file content as lisp object"
  (with-temp-buffer
    (insert-file-contents filePath)
    (read (buffer-string))))

(setq l-env (read-file l-env-file))


#+END_SRC

#+results:
: work

#+BEGIN_SRC emacs-lisp
(load-file (concat l-elisp-home l-env ".el"))
#+END_SRC

* Keybindings

#+begin_src emacs-lisp
(use-package free-keys :defer t)
(use-package bind-key  :defer t)
(define-prefix-command 'my-map)
(bind-key "C-1" 'my-map)
#+end_src
* Ivy / Counsel

#+BEGIN_SRC emacs-lisp
(use-package swiper)
(use-package counsel
  :bind (("C-b" . ivy-switch-buffer)
         ("C-s" . swiper)
         :map my-map
         ("q" . counsel-rg))
  :config (ivy-mode 1)
  :init
  (progn
    (ido-mode -1) ;; Turn off ido mode in case I enabled it accidentally
    (setq ivy-wrap t)
    (setq ivy-use-virtual-buffers t
          ivy-height 25)
    (setq enable-recursive-minibuffers t)

    (global-set-key (kbd "C-c C-r") 'ivy-resume)
    (global-set-key (kbd "<f6>") 'ivy-resume)
    (global-set-key (kbd "M-x") 'counsel-M-x)
    (global-set-key (kbd "C-x C-f") 'counsel-find-file)
    (global-set-key (kbd "<f1> f") 'counsel-describe-function)
    (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
    (global-set-key (kbd "<f1> l") 'counsel-find-library)
    (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
    (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
    (global-set-key (kbd "C-r") 'counsel-git)
    (global-set-key (kbd "C-c j") 'counsel-git-grep)
    (global-set-key (kbd "C-c k") 'counsel-ag)
                                        ;    (global-set-key (kbd "C-x l") 'counsel-locate)
    (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)))
#+END_SRC

#+results:

* Org
[2017-06-05 Mon 09:42]

I start from [[file:org-mode.org::#HowToUseThisDocument][Bernt's org-mode.org]]
#+BEGIN_SRC emacs-lisp
(load (concat l-elisp-home "org-mode.el"))

(defun l-org-jump-to-dir ()
  (interactive)
  (if (eq major-mode 'org-mode)
      (if-let ((headers (org-entry-get (point) "header-args" t)))
          (let* ((props (org-babel-parse-header-arguments headers))
                (dir (cdr (assoc :dir props))))
            (if dir (progn
                      (find-file dir)
                      (magit-status)
                      (delete-other-windows))
              (magit-status)))
        (magit-status))
    (magit-status)))

(bind-key "C-." 'l-org-jump-to-dir org-mode-map)

(fset 'l-org-goto-clean-agenda
      "\C-\\ g.ro")

(eval-after-load 'org-src
  '(define-key org-src-mode-map
     "\C-x\C-s" #'org-edit-src-exit))

(bind-key "w" 'l-org-goto-clean-agenda my-map)

;; https://mollermara.com/blog/Fast-refiling-in-org-mode-with-hydras/
(defun my/refile (file headline &optional arg)
  (let ((pos (save-excursion
               (find-file file)
               (org-find-exact-headline-in-buffer headline))))
    (message "%s %s %s %s" arg headline file pos)
    (org-refile arg nil (list headline file nil pos)))
  (switch-to-buffer (current-buffer)))
#+END_SRC

** My customisations
#+BEGIN_SRC emacs-lisp

(defun l-beginning-of-block ()
  (interactive)
  (org-babel-mark-block)
  (exchange-point-and-mark))

  (setq org-M-RET-may-split-line '((default . nil)))

(fset 'l-org-new-line-at-end
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([3 14 left return] 0 "%d")) arg)))

(bind-key "e" 'l-org-new-line-at-end my-map)
#+END_SRC
** show agenda when idle

#+begin_src emacs-lisp

 (defun jump-to-org-agenda ()
   (interactive)
   (let ((buf (get-buffer "*Org Agenda*"))
         wind)
     (if buf
         (if (setq wind (get-buffer-window buf))
             (select-window wind)
           (if (called-interactively-p)
               (progn
                 (select-window (display-buffer buf t t))
                 (org-fit-window-to-buffer)
                 ;; (org-agenda-redo)
                 )
             (with-selected-window (display-buffer buf)
               (org-fit-window-to-buffer)
               ;; (org-agenda-redo)
               )))
       (call-interactively 'org-agenda-list)))
   ;;(let ((buf (get-buffer "*Calendar*")))
   ;;  (unless (get-buffer-window buf)
   ;;    (org-agenda-goto-calendar)))
   )

 (run-with-idle-timer 300 t 'jump-to-org-agenda)


#+end_src
** super-agenda
#+BEGIN_SRC emacs-lisp

(use-package org-super-agenda
  :config
  (progn
    (org-super-agenda-mode)
    (setq org-super-agenda-groups
          '((:todo "HOLD" :todo "WAITING" :order 300)
            (:name "A" :priority "A")
            (:name "B" :priority "B")
            (:name "C" :priority "C" :order 200)))))
#+END_SRC


** Babel
*** tangle .emacs on save

#+begin_src emacs-lisp

(defvar l-dot-emacs (concat l-elisp-home "dot-emacs.org"))

(defun my/tangle-on-save-emacs-config-org-file ()
  (when (string= buffer-file-name l-dot-emacs)
    (org-babel-tangle)))

(add-hook 'after-save-hook 'my/tangle-on-save-emacs-config-org-file)

#+end_src
*** languages


* home
:PROPERTIES:
:header-args: :tangle home.el
:END:
** media
#+BEGIN_SRC emacs-lisp :tangle no
(use-package elfeed)

(use-package elfeed-org
  :init (progn
          ;; Load elfeed-org
          (require 'elfeed-org)

          ;; Initialize elfeed-org
          ;; This hooks up elfeed-org to read the configuration when elfeed
          ;; is started with =M-x elfeed=
          (elfeed-org)

          (setq rmh-elfeed-org-files (list "~/doc/org/non-agenda/elfeed.org"))))
#+END_SRC
** misc
#+BEGIN_SRC emacs-lisp
(setq org-user-agenda-files (quote ("~/doc/org/1" "~/doc/org"
                                    "~/doc/org/2")))
(setq org-directory "~/doc/org")

(setq org-default-notes-file "~/doc/org/refile.org")

;; Capture templates for: TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol
(setq org-capture-templates
      (quote (("t" "todo" entry (file "~/doc/org/refile.org")
               "* NEXT %?\n%U\n%a\n" :clock-in t :clock-resume t)
              ("r" "respond" entry (file "~/doc/org/refile.org")
               "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t :immediate-finish t)
              ("n" "note" entry (file "~/doc/org/refile.org")
               "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
              ("j" "Journal" entry (file+datetree "~/doc/org/diary.org")
               "* %?\n%U\n" :clock-in t :clock-resume t)
              ("w" "org-protocol" entry (file "~/doc/org/refile.org")
               "* TODO Review %c\n%U\n" :immediate-finish t)
              ("m" "Meeting" entry (file "~/doc/org/refile.org")
               "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)
              ("p" "Phone call" entry (file "~/doc/org/refile.org")
               "* PHONE %? :PHONE:\n%U" :clock-in t :clock-resume t)
              ("h" "Habit" entry (file "~/doc/org/refile.org")
               "* NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n"))))

(setq org-global-properties (quote (("Effort_ALL" . "0:07 0:15 0:30 1:00 2:00 4:00 6:00 10:00 16:00 0:00")
                                    ("STYLE_ALL" . "habit"))))


(setq org-tag-alist (quote (("FLAGGED" . ??)
                            ("MYWORK" . ?w)
                            ("FAMILY" . ?f)
                            ("SELF" . ?s)
                            ("ADRI" . ?a)
                            ("META" . ?m)
                            ("FRIENDS" . ?r)
                            ("READING" . ?d)
                            )))

(set-register ?d '(file . "/laheadle@drive.stinkless.org:/home/laheadle"))
(set-register ?r '(file . "/root@drive.stinkless.org:/etc"))
(defun remote-flash-shell ()
  (interactive)
  (let ((od default-directory))
    (setq default-directory "/laheadle@flash.stinkless.org:/")
    (unwind-protect
        (call-interactively 'shell)
      (setq default-directory od))))

(global-set-key "\C-c\C-f" 'remote-flash-shell)

#+END_SRC


* hydra

#+BEGIN_SRC emacs-lisp
(use-package hydra)
#+END_SRC


* work
:PROPERTIES:
:header-args: :tangle work.el
:END:

