elisp/dot-emacs.org
** org 
#+begin_src emacs-lisp :tangle no

(defhydra l/org-refile-hydra (:foreign-keys run) 
  "Refile"
  ("w" (my/refile "~/Workspace/docs/org/work.org" "Work") "Refile to Work")
  ("u" (my/refile "~/Workspace/docs/org/work.org" "avui") "Refile to avui")
  ("j" org-refile-goto-last-stored "Jump to last refile")
  ("q" nil "cancel"))

(bind-key "r" 'l/org-refile-hydra/body 'my-map)


#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq org-tag-alist (quote (
                            ("FLAGGED" . ??)
                            ("MATT" . ?m)
                            ("NOTE" . ?n)
                            ("RETRO" . ?r)
                            )))


(setq org-directory "~/Workspace/docs/org")
(setq org-default-notes-file "~/Workspace/docs/org/refile.org")

;; Capture templates for: TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol
(setq org-capture-templates
      (quote (("t" "todo" entry (file "~/Workspace/docs/org/refile.org")
               "* NEXT %?\n%U\n%a\n" :clock-in t :clock-resume t)
              ("r" "review" entry (file+olp "~/Workspace/docs/org/work.org" "Review")
               "* NEXT [#A] Review: %? \nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t)
              ("u" "avalon ui" entry (file+olp "~/Workspace/docs/org/work.org" "Avalon" "avui")
               "* NEXT AVUI: %? [%]\nSCHEDULED: %t\n%U\n%a\n** NEXT \n** NEXT \n** NEXT commit message\n** NEXT consider testing\n" :clock-in t :clock-resume t)
              ("n" "note" entry (file "~/Workspace/docs/org/refile.org")
               "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
              ("j" "Journal" entry (file+datetree "~/Workspace/docs/org/diary.org")
               "* %?\n%U\n" :clock-in t :clock-resume t)
              ("w" "org-protocol" entry (file "~/Workspace/docs/org/refile.org")
               "* TODO Review %c\n%U\n" :immediate-finish t)
              ("m" "Meeting" entry (file "~/Workspace/docs/org/refile.org")
               "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)
              ("p" "Phone call" entry (file "~/Workspace/docs/org/refile.org")
               "* PHONE %? :PHONE:\n%U" :clock-in t :clock-resume t)
              ("h" "Habit" entry (file "~/Workspace/docs/org/refile.org")
               "* NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n"))))

#+END_SRC

** other
#+BEGIN_SRC emacs-lisp
(defun l-getenv (var)
  (shell-command-to-string (concat ". ~/.bashrc; echo -n $" var)))

(setq org-user-agenda-files (quote ("~/Workspace/docs/org")))

(setq mouse-wheel-scroll-amount '(3 ((shift) . 3))) ;; lines at a time
    
(setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling

(set-register ?w '(file . "~/Workspace/Sketchpad/Web"))
(set-register ?t `(file . ,(l-getenv "tk")))
(set-register ?g '(file . "/Users/lyn_headley/Workspace/glossary/g"))
(set-register ?a '(file . "/Users/lyn_headley/Workspace/asset-registry/a"))

(defun l-show-make-var ()
  (interactive)
    (cl-flet ((my-word-at-point ()
                             (buffer-substring
                              (+ 1 (save-excursion (search-backward "(" nil t)))
                              (- (save-excursion (search-forward ")" nil t)) 1))))

  (let ((cmd-str  (concat "make print-"
                          (my-word-at-point))))
                                   ;(buffer-substring (region-beginning) (region-end)))))
    (let ((default-directory "/Users/lyn_headley/Workspace/WebGSP/"))
      (message "%s" (shell-command-to-string cmd-str))))))

#+END_SRC
** erlang
#+BEGIN_SRC emacs-lisp
;;

;; fix stupid mousedown sets mark
;; http://stackoverflow.com/questions/13986605/how-to-make-emacs-mouse-drag-not-highlight-or-set-mark

#+END_SRC

** Shells and terminals

#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :config (exec-path-from-shell-initialize))
#+END_SRC
** terraform

(use-package terraform-mode)
* completion
** company
#+BEGIN_SRC emacs-lisp
(use-package company
  :init
  (global-company-mode))
#+END_SRC

* Helm

#+BEGIN_SRC emacs-lisp :tangle no

(use-package helm
  :diminish helm-mode
  :init
  (progn
    (require 'helm-config)
    (setq helm-candidate-number-limit 100)

    ;; From https://gist.github.com/antifuchs/9238468
    (setq helm-idle-delay 0.0 ; update fast sources immediately (doesn't).
          helm-input-idle-delay 0.01  ; this actually updates things
                                        ; reeeelatively quickly.
          helm-yas-display-key-on-candidate t
          helm-quick-update t
          helm-mode-fuzzy-match t
          helm-completion-in-region-fuzzy-match t
          helm-M-x-requires-pattern nil
          helm-ff-skip-boring-files t
          helm-grep-ag-command "rg --color=always --colors 'match:fg:black' --colors 'match:bg:yellow' --smart-case --no-heading --line-number %s %s %s"
          helm-grep-ag-pipe-cmd-switches '("--colors 'match:fg:black'" "--colors 'match:bg:yellow'"))
    ;(helm-mode)
    ;(helm-adaptive-mode t)
    (require 'grep)
    (add-to-list 'grep-find-ignored-directories "t2k-applet")
    (add-to-list 'grep-find-ignored-directories "node_modules")
    )
  :bind (("C-c h" . helm-mini)
         ("C-h a" . helm-apropos)
         ;("C-x b" . helm-buffers-list)
         ("M-y" . helm-show-kill-ring)
         ("M-x" . helm-M-x)
         ;("C-x C-f" . helm-find-files)
         ("C-x c o" . helm-occur)
         ("C-x c s" . helm-swoop)
         ("C-x c y" . helm-yas-complete)
         ("C-x c Y" . helm-yas-create-snippet-on-region)
         ("C-x c SPC" . helm-all-mark-rings)))
(ido-mode -1) ;; Turn off ido mode in case I enabled it accidentally
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package helm-org-rifle
  :bind ("C-c g" . helm-org-rifle-agenda-files))

(use-package helm-ls-git)

;(use-package helm-git-grep)

(use-package helm-descbinds
  :init (helm-descbinds-mode))

#+END_SRC
** byte compiling packages

#+BEGIN_SRC emacs-lisp :tangle no
(setq async-bytecomp-allowed-packages '(all))
#+END_SRC


* toggling

#+begin_src emacs-lisp
(define-prefix-command 'endless/toggle-map)
;; The manual recommends C-c for user keys, but C-x t is
;; always free, whereas C-c t is used by some modes.
(define-key ctl-x-map "t" 'endless/toggle-map)
(define-key endless/toggle-map "c" #'column-number-mode)
(define-key endless/toggle-map "d" #'toggle-debug-on-error)
(define-key endless/toggle-map "e" #'toggle-debug-on-error)
(define-key endless/toggle-map "f" #'auto-fill-mode)
(define-key endless/toggle-map "l" #'toggle-truncate-lines)
(define-key endless/toggle-map "q" #'toggle-debug-on-quit)
(define-key endless/toggle-map "m" #'transient-mark-mode)
(define-key endless/toggle-map "t" #'transient-mark-mode)
(define-key endless/toggle-map "s" #'org-super-agenda-mode)
(define-key endless/toggle-map "i" 'ido-mode)
(define-key endless/toggle-map "v" 'ivy-mode)

;;; Generalized version of `read-only-mode'.
(define-key endless/toggle-map "r" #'dired-toggle-read-only)
(autoload 'dired-toggle-read-only "dired" nil t)
(define-key endless/toggle-map "w" #'whitespace-mode)
#+end_src


* narrow/widen
#+begin_src emacs-lisp

(put 'narrow-to-region 'disabled nil)

(defun narrow-or-widen-dwim (p)
  "Widen if buffer is narrowed, narrow-dwim otherwise.
Dwim means: region, org-src-block, org-subtree, or
defun, whichever applies first. Narrowing to
org-src-block actually calls `org-edit-src-code'.

With prefix P, don't widen, just narrow even if buffer
is already narrowed."
  (interactive "P")
  (declare (interactive-only))
  (cond ((and (buffer-narrowed-p) (not p)) (widen))
        ((region-active-p)
         (narrow-to-region (region-beginning)
                           (region-end)))
        ((derived-mode-p 'org-mode)
         ;; `org-edit-src-code' is not a real narrowing
         ;; command. Remove this first conditional if
         ;; you don't want it.
         (cond ((ignore-errors (org-edit-src-code) t)
                (delete-other-windows))
               ((ignore-errors (org-narrow-to-block) t))
               (t (org-narrow-to-subtree))))
        ((derived-mode-p 'latex-mode)
         (LaTeX-narrow-to-environment))
        (t (narrow-to-defun))))

(define-key endless/toggle-map "n"
  #'narrow-or-widen-dwim)
;; This line actually replaces Emacs' entire narrowing
;; keymap, that's how much I like this command. Only
;; copy it if that's what you want.
(define-key ctl-x-map "n" #'narrow-or-widen-dwim)

#+end_src

#+results:
: narrow-or-widen-dwim

* tabs/indentation

#+BEGIN_SRC emacs-lisp
(defun l-set-tab-width ()
  (setq tab-width (if (eq major-mode 'emacs-lisp-mode) 8 4)))
(add-hook 'emacs-lisp-mode-hook 'l-set-tab-width)
(add-hook 'after-change-major-mode-hook 
          '(lambda () 
             (setq-default indent-tabs-mode nil)
             (setq c-basic-indent 4)
             (l-set-tab-width)))


#+END_SRC
* Text manipulation and Motion

** grep

#+BEGIN_SRC emacs-lisp
(use-package wgrep
:config (setq wgrep-auto-save-buffer t))
#+END_SRC


** folding

#+BEGIN_SRC emacs-lisp
(use-package origami
  :defer t
  :init
  (progn
    (global-origami-mode)
    (defhydra hydra-folding (my-map "f" :color red)
      "
  _o_pen node    _n_ext fold       toggle _f_orward
  _c_lose node   _p_revious fold   toggle _a_ll
  "
      ("o" origami-open-node)
      ("c" origami-close-node)
      ("n" origami-next-fold)
      ("p" origami-previous-fold)
      ("f" origami-forward-toggle-node)
      ("a" origami-toggle-all-nodes))))
#+END_SRC
** misc and regions
#+BEGIN_SRC emacs-lisp

(put 'upcase-region 'disabled nil)

(delete-selection-mode 1)

(use-package expand-region
  :bind ("C-@" . er/expand-region))

(define-key global-map (kbd "M-k")
  (lambda () (interactive)
    (kill-ring-save (point) (line-end-position))))

(global-set-key "\C-p" 'beginning-of-line)

;; Shift the selected region right if distance is positive, left if
;; negative

(defun shift-region (distance)
  (let ((mark (mark)))
    (save-excursion
      (indent-rigidly (region-beginning) (region-end) distance)
      (push-mark mark t t)
      ;; Tell the command loop not to deactivate the mark
      ;; for transient mark mode
      (setq deactivate-mark nil))))

(defun shift-right ()
  (interactive)
  (shift-region 1))

(defun shift-left ()
  (interactive)
  (shift-region -1))

;; Bind (shift-right) and (shift-left) function to your favorite keys. I use
;; the following so that Ctrl-Shift-Right Arrow moves selected text one 
;; column to the right, Ctrl-Shift-Left Arrow moves selected text one
;; column to the left:

(global-set-key [C-S-right] 'shift-right)
(global-set-key [C-S-left] 'shift-left)


(defun backward-some ()
  (interactive)
  (forward-line -10))
(defun forward-some ()
  (interactive)
  (forward-line 10))

(define-key global-map (kbd "M-<up>") 'backward-some)
(define-key global-map (kbd "M-<down>") 'forward-some)


(autoload 'zap-up-to-char "misc"
    "Kill up to, but not including ARGth occurrence of CHAR.
  
  \(fn arg char)"
    'interactive)

  (global-set-key "\M-z" 'zap-to-char)


#+END_SRC
** kill line efficiently (thanks kholidfu)
#+BEGIN_SRC emacs-lisp
(defadvice kill-region (before slick-cut activate compile)
  (interactive
   (if mark-active (list (region-beginning) (region-end))
     (list (line-beginning-position) (line-beginning-position 2)))))
#+END_SRC
** undo-tree

#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :init (global-undo-tree-mode 1)
  :bind (("C-z" . undo-tree-undo)
         ("C-S-z" . undo-tree-redo)))

#+END_SRC

* Files and directories

Remote Directroies
#+BEGIN_SRC emacs-lisp :tangle work.el
(set-register ?d '(file . "/lheadley@dn.kcptech.com:/home/lheadley"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; watch the file system
(global-auto-revert-mode nil)

(setq make-backup-files nil)


(setq dired-guess-shell-alist-user
      (list
       (list "\\.zip$" "munzip")))


(prefer-coding-system 'utf-8)

(setq require-final-newline nil)
(setq mode-require-final-newline nil)

(defun l-reload() (interactive) 
  (let ((m (point)))
    (find-alternate-file (buffer-file-name))
    (goto-char m)))

(defun l-backups ()
  (shell-command "backups.sh&"))

(defvar one-hour (* 60 60))
(run-with-timer one-hour (* 24 one-hour) 'l-backups)

#+END_SRC
* Frames
** space savers
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(menu-bar-mode -1)
#+END_SRC
