elisp/dot-emacs.org
* Windows
#+BEGIN_SRC emacs-lisp
(use-package ace-window
  :bind ("M-p" . ace-window)
  :config
  (progn
    (setq aw-dispatch-always t)

    (defhydra hydra-window-frame (:color red)
      "Frame"
      ("f" make-frame "new frame")
      ("x" delete-frame "delete frame")
      ("n" ns-next-frame "next frame"))
    (defhydra hydra-window-size (:color red)
      "Windows size"
      ("h" shrink-window-horizontally "shrink horizontal")
      ("j" shrink-window "shrink vertical")
      ("k" enlarge-window "enlarge vertical")
      ("l" enlarge-window-horizontally "enlarge horizontal"))
    (add-to-list 'aw-dispatch-alist '(?w hydra-window-size/body) t)
    (add-to-list 'aw-dispatch-alist '(?\; hydra-window-frame/body) t)
    (ace-window-display-mode t)))
    #+END_SRC
    
    #+BEGIN_SRC emacs-lisp


#+END_SRC

* shells

#+BEGIN_SRC emacs-lisp
(defun eshell-here ()
  "Opens up a new shell in the directory associated with the
current buffer's file. The eshell is renamed to match that
directory to make multiple eshell windows easier."
  (interactive)
  (let* ((parent (if (buffer-file-name)
                     (file-name-directory (buffer-file-name))
                   default-directory))
         (height (/ (window-total-height) 3))
         (name   (car (last (split-string parent "/" t)))))
    (split-window-vertically (- height))
    (other-window 1)
    (eshell "new")
    (rename-buffer (concat "*eshell: " name "*"))

    (insert (concat "ls"))
    (eshell-send-input)))

(bind-key "C-!" 'eshell-here)

(defun eshell/x ()
  (delete-window)
  (eshell/exit))
#+END_SRC

* Miscellaneous
#+BEGIN_SRC emacs-lisp

(global-eldoc-mode -1)
 
(use-package with-editor)

(fset 'yes-or-no-p 'y-or-n-p)

;; irc
(setq circe-reduce-lurker-spam t)

(server-start)

(use-package yaml-mode
  :init (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode)))

(column-number-mode)

(setq debug-on-error t)
#+END_SRC

** http
#+BEGIN_SRC emacs-lisp
(use-package ob-http)
#+END_SRC
* csv mode
#+begin_src emacs-lisp

(use-package csv-mode)

#+end_src
* dictionary, lookups, drilling
#+BEGIN_SRC emacs-lisp

(defun start-org-drill ()
  (interactive)
  (setq org-drill-maximum-duration 5)
  (require 'org-drill)
  (org-drill))

(use-package xah-lookup)
(defun my-lookup-rae (&optional *word)
  "lookup rae doc of word under cursor"
  (interactive)
  (require 'xah-lookup)
  (xah-lookup-word-on-internet
   ,*word
   (get 'my-lookup-rae 'xah-lookup-url )
   (get 'my-lookup-rae 'xah-lookup-browser-function )))

(put 'my-lookup-rae 'xah-lookup-url "http://dle.rae.es/?w=word02051")
(put 'my-lookup-rae 'xah-lookup-browser-function 'browse-url)

#+END_SRC

#+BEGIN_SRC emacs-lisp
;(use-package dictionary)
#+END_SRC
* gnuplot

#+begin_src emacs-lisp

(use-package gnuplot)

#+end_src

* git
** pull requests - home and work


#+BEGIN_SRC emacs-lisp :header-args :tangle home.el

(defun endless/visit-pull-request-url ()
  "Visit the current branch's PR on Github."
  (interactive)
  (browse-url
   (format "https://github.com/%s/pull/new/%s"
           (replace-regexp-in-string
            "\\`.+github\\.com:\\(.+\\)\\.git\\'" "\\1"
            (magit-get "remote"
                       (magit-get-push-remote)
                       "url"))
           (magit-get-current-branch))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :header-args :tangle work.el

(defun endless/visit-pull-request-url ()
  "Visit the current branch's PR on Github."
  (interactive)
  (browse-url
   (format "https://github.mheducation.com/%s/pull/new/%s"
           (replace-regexp-in-string
            "\\`.+github\\.mheducation\\.com:\\(.+\\)\\.git\\'" "\\1"
            (magit-get "remote"
                       (magit-get-push-remote)
                       "url"))
           (magit-get-current-branch))))
#+END_SRC

** magit 
#+BEGIN_SRC emacs-lisp
(use-package magit
  :init (setq magit-popup-use-prefix-argument nil
              magit-commit-show-diff nil
              magit-completing-read-function 'ivy-completing-read
              magit-revert-buffers 1
              magit-diff-refine-hunk 'all
              magit-visit-ref-create t)
  :config (progn
            (magit-define-popup-action 'magit-merge-popup ?u
                                       "Catch Up To Upstream"
                                       (lambda ()
                                         (interactive)
                                         (magit-merge "@{upstream}"))))
  :bind (("C-." . magit-status)
         :map magit-mode-map
         ("v" . endless/visit-pull-request-url)))


#+END_SRC
** add to popup: merge upstream
#+BEGIN_SRC emacs-lisp


#+END_SRC
* TODO languages
** HTML
#+BEGIN_SRC emacs-lisp

(use-package emmet-mode
  :init
  (progn
    (add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
    (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.
    (setq emmet-move-cursor-between-quotes t))) ;; default nil

#+END_SRC
** ocaml

#+begin_src emacs-lisp

(use-package tuareg)
(use-package merlin)

(let ((opam-share (ignore-errors (car (process-lines "opam" "config" "var" "share")))))
 (when (and opam-share (file-directory-p opam-share))
  (add-to-list 'load-path (expand-file-name "emacs/site-lisp" opam-share))
  (autoload 'merlin-mode "merlin" nil t nil)
  (add-hook 'tuareg-mode-hook 'merlin-mode t)
  (add-hook 'caml-mode-hook 'merlin-mode t)))

(with-eval-after-load 'company
  (add-to-list 'company-backends 'merlin-company-backend))

(add-hook 'merlin-mode-hook 'company-mode)

(defun l-config-merlin () '((logfile . "/tmp/merlin")))
(setq merlin-debug t)

(setq merlin-configuration-function #'l-config-merlin)
#+end_src
** cider
#+BEGIN_SRC emacs-lisp
(use-package cider
  :defer t
  :init
  (setq cider-prompt-for-symbol nil
        cider-cljs-lein-repl
        "(do (require 'figwheel-sidecar.repl-api)
           (figwheel-sidecar.repl-api/start-figwheel!)
           (figwheel-sidecar.repl-api/cljs-repl))"))

(use-package clojure-cheatsheet :defer t)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
(use-package helm-cider
  :defer t
  :config (helm-cider-mode 1))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package cider-hydra :defer t)

(add-hook 'cider-mode-hook #'cider-hydra-mode)

#+END_SRC


** Javascript

#+BEGIN_SRC emacs-lisp
(add-hook 'js-mode-hook (lambda () (abbrev-mode 1)))

(setq js-indent-level 2)
(setq-default indent-tabs-mode nil)

(use-package js2-mode
  :init (progn
          (setq js2-mode-hook
                '(lambda ()
                   (progn
                     (show-paren-mode 1)
                     (define-key js2-mode-map "\C-ci" 'js-doc-insert-function-doc)
                     (define-key js2-mode-map "@" 'js-doc-insert-tag)
                     (electric-indent-local-mode -1)
                     (set-variable 'indent-tabs-mode nil))))

          (add-to-list 'auto-mode-alist '("\\.js$" . js2-mode))))


#+END_SRC
*** nvm
#+BEGIN_SRC emacs-lisp

(use-package nvm)

(defun do-nvm-use (version)
  (interactive "sVersion: ")
  (nvm-use version))

(defun l-show-nvm-installed-versions ()
  (interactive)
  (message "%s" (nvm--installed-versions)))

(defun run-node (cwd)
  (interactive "DDirectory: ")
  (unless (executable-find "node")
    (call-interactively 'do-nvm-use))
  (let ((default-directory cwd))
        (pop-to-buffer (make-comint (format "node-repl-%s" cwd) "node" nil "--interactive"))))

#+END_SRC
** Typescript

#+BEGIN_SRC emacs-lisp
(defun setup-tide-mode ()
  (interactive)
  (tide-setup)
  (flycheck-mode +1)
  (setq flycheck-check-syntax-automatically '(save mode-enabled))
  (eldoc-mode +1)
  (tide-hl-identifier-mode +1)
  (setq typescript-indent-level 2)

  ;; company is an optional dependency. You have to
  ;; install it separately via package-install
  ;; `M-x package-install [ret] company`
  (company-mode +1))

(use-package tide
  :init (progn
          ;; aligns annotation to the right hand side
          (setq company-tooltip-align-annotations t)
          (setq tide-tsserver-process-environment '("TSS_LOG=-level verbose -file /tmp/tss.log"))

          (setq tide-tsserver-executable "node_modules/typescript/bin/tsserver")

          (add-hook 'typescript-mode-hook #'setup-tide-mode)))
#+END_SRC
*** Angular

#+BEGIN_SRC emacs-lisp
;(use-package ng2-mode) 
#+END_SRC

** Smartparens

#+BEGIN_SRC emacs-lisp
(use-package smartparens
  :init
  (progn
    (require 'smartparens-config)
    (add-hook 'html-mode-hook #'smartparens-mode)
    (add-hook 'js-mode-hook #'smartparens-mode)
    (add-hook 'typescript-mode-hook #'smartparens-mode)))


(defhydra hydra-learn-sp (my-map "p" :hint nil)
  "
  _B_ backward-sexp            -----
  _F_ forward-sexp               _s_ splice-sexp
  _L_ backward-down-sexp         _df_ splice-sexp-killing-forward
  _H_ backward-up-sexp           _db_ splice-sexp-killing-backward
^^------                         _da_ splice-sexp-killing-around
  _k_ down-sexp                -----
  _j_ up-sexp                    _C-s_ select-next-thing-exchange
-^^-----                         _C-p_ select-previous-thing
  _n_ next-sexp                  _C-n_ select-next-thing
  _p_ previous-sexp            -----
  _a_ beginning-of-sexp          _C-f_ forward-symbol
  _z_ end-of-sexp                _C-b_ backward-symbol
--^^-                          -----
  _t_ transpose-sexp             _c_ convolute-sexp
-^^--                            _g_ absorb-sexp
  _x_ delete-char                _q_ emit-sexp
  _dw_ kill-word               -----
  _dd_ kill-sexp                 _,b_ extract-before-sexp
-^^--                            _,a_ extract-after-sexp
  _S_ unwrap-sexp              -----
-^^--                            _AP_ add-to-previous-sexp
  _C-h_ forward-slurp-sexp       _AN_ add-to-next-sexp
  _C-l_ forward-barf-sexp      -----
  _C-S-h_ backward-slurp-sexp    _ join-sexp
  _C-S-l_ backward-barf-sexp     _|_ split-sexp
"
  ;; TODO: Use () and [] - + * | <space>
  ("B" sp-backward-sexp );; similiar to VIM b
  ("F" sp-forward-sexp );; similar to VIM f
  ;;
  ("L" sp-backward-down-sexp )
  ("H" sp-backward-up-sexp )
  ;;
  ("k" sp-down-sexp ) ; root - towards the root
  ("j" sp-up-sexp )
  ;;
  ("n" sp-next-sexp )
  ("p" sp-previous-sexp )
  ;; a..z
  ("a" sp-beginning-of-sexp )
  ("z" sp-end-of-sexp )
  ;;
  ("t" sp-transpose-sexp )
  ;;
  ("x" sp-delete-char )
  ("dw" sp-kill-word )
  ;;("ds" sp-kill-symbol ) ;; Prefer kill-sexp
  ("dd" sp-kill-sexp )
  ;;("yy" sp-copy-sexp ) ;; Don't like it. Pref visual selection
  ;;
  ("S" sp-unwrap-sexp ) ;; Strip!
  ;;("wh" sp-backward-unwrap-sexp ) ;; Too similar to above
  ;;
  ("C-h" sp-forward-slurp-sexp )
  ("C-l" sp-forward-barf-sexp )
  ("C-S-h" sp-backward-slurp-sexp )
  ("C-S-l" sp-backward-barf-sexp )
  ;;
  ;;("C-[" (bind (sp-wrap-with-pair "[")) ) ;;FIXME
  ;;("C-(" (bind (sp-wrap-with-pair "(")) )
  ;;
  ("s" sp-splice-sexp )
  ("df" sp-splice-sexp-killing-forward )
  ("db" sp-splice-sexp-killing-backward )
  ("da" sp-splice-sexp-killing-around )
  ;;
  ("C-s" sp-select-next-thing-exchange )
  ("C-p" sp-select-previous-thing )
  ("C-n" sp-select-next-thing )
  ;;
  ("C-f" sp-forward-symbol )
  ("C-b" sp-backward-symbol )
  ;;
  ;;("C-t" sp-prefix-tag-object)
  ;;("H-p" sp-prefix-pair-object)
  ("c" sp-convolute-sexp )
  ("g" sp-absorb-sexp )
  ("q" sp-emit-sexp )
  ;;
  (",b" sp-extract-before-sexp )
  (",a" sp-extract-after-sexp )
  ;;
  ("AP" sp-add-to-previous-sexp );; Difference to slurp?
  ("AN" sp-add-to-next-sexp )
  ;;
  ("_" sp-join-sexp ) ;;Good
  ("|" sp-split-sexp )) 
#+END_SRC

** parens
#+BEGIN_SRC emacs-lisp
(show-paren-mode)
#+END_SRC
** erlang
:PROPERTIES:
:header-args: :tangle home.el
:END:
#+BEGIN_SRC emacs-lisp
(progn
  (setq load-path (cons  "/usr/lib/erlang/lib/tools-2.9.1/emacs"
                         load-path))
      (setq erlang-root-dir "/usr/lib/erlang")
      (setq exec-path (cons "/usr/lib/erlang/bin" exec-path))
      (require 'erlang-start))

;; (add-to-list 'load-path "/Users/lyn_headley/.emacs.d/site-lisp/distel/elisp")
;; (require 'distel)
;; (distel-setup)
;; (defconst distel-shell-keys
;;   '(("\C-\M-i"   erl-complete)
;;     ("\M-?"      erl-complete)
;;     ("\M-."      erl-find-source-under-point)
;;     ("\M-,"      erl-find-source-unwind)
;;     ("\M-*"      erl-find-source-unwind)
;;     )
;;   "Additional keys to bind when in Erlang shell.")

;; (add-hook 'erlang-shell-mode-hook
;;           (lambda ()
;;             ;; add some Distel bindings to the Erlang shell
;;             (dolist (spec distel-shell-keys)
;;               (define-key erlang-shell-mode-map (car spec) (cadr spec)))))

;; (defvar l-ebin-epgsql "/Users/lyn_headley/Workspace/trails/erlang/sg/deps/epgsql/ebin")
;; (defvar l-ebin-sg "/Users/lyn_headley/Workspace/trails/erlang/sg/ebin")
;; (defconst l-include-sg "/Users/lyn_headley/Workspace/trails/erlang/sg/include")
;; (defvar l-ebin-yaws "/Users/lyn_headley/Workspace/trails/erlang/sg/deps/yaws/ebin")
;; (defvar l-include-yaws "/Users/lyn_headley/Workspace/trails/erlang/sg/deps/yaws/include")
;; (defvar l-ebin-poolboy "/Users/lyn_headley/Workspace/trails/erlang/sg/deps/poolboy/ebin")

;; (setq erlang-compile-extra-opts (list `(i . ,l-include-yaws)
;;                                       `(i . ,l-include-sg)
;;                                       ))

;; (setq inferior-erlang-machine-options
;;      (list "-name" "dev@localhost"
;;             "-pa" l-ebin-sg
;;            "-pa" l-ebin-yaws
;;            "-pa" l-ebin-epgsql
;;            "-pa" l-ebin-poolboy))



#+END_SRC
** lisp
#+BEGIN_SRC emacs-lisp

(use-package lispy :defer t)

  ;; :init
(dolist (hook '(emacs-lisp-mode-hook
                  clojure-mode-hook))
    (add-hook hook (lambda () (lispy-mode 1))))
#+END_SRC
** php
#+BEGIN_SRC emacs-lisp

(use-package php-mode)

#+END_SRC
** markdown

#+BEGIN_SRC emacs-lisp
(use-package markdown-mode :defer t)
#+END_SRC

** babel
#+BEGIN_SRC emacs-lisp
(require 'ob-gnuplot)
(org-babel-do-load-languages
 'org-babel-load-languages '((shell . t)
                             (gnuplot . t)
                             (emacs-lisp . t)
                             (http . t)
                             (org . t)))

(setq org-babel-default-header-args:sh
  '((:prologue . "exec 2>&1") (:epilogue . ":")))
#+END_SRC
* desktop
#+BEGIN_SRC emacs-lisp
(desktop-save-mode -1)
(setq desktop-restore-eager 10)
#+END_SRC
* templates/snippets
** yankpad
#+BEGIN_SRC emacs-lisp
(use-package yasnippet)
(use-package yankpad)

#+END_SRC
